## 数据的合并笔记

默认的是inner的形式

列之间的合并：
pd.merge()

要全量合并，用how='outer'，其中一方没有的用Nan

要按某一数据进行合并，用how='left'or how='right'

行之间的合并:pd.concat([])

ignore_index=True,忽略index

增加数据：data.append(pd.Series[]),增加了一行数据

In [6]:
import numpy as np
import pandas as pd

In [32]:
data_1=pd.DataFrame({'one':['a','b','a','a','c','b'],'two':range(6)})

In [33]:
data_2=pd.DataFrame({'one':['a','b','c','d'],'two':range(10,14)})

In [34]:
data_1

  one  two
0   a    0
1   b    1
2   a    2
3   a    3
4   c    4
5   b    5

In [35]:
data_2

  one  two
0   a   10
1   b   11
2   c   12
3   d   13

In [36]:
data=pd.merge(data_1,data_2,on='one')#按相同的列合并

In [37]:
data

  one  two_x  two_y
0   a      0     10
1   a      2     10
2   a      3     10
3   b      1     11
4   b      5     11
5   c      4     12

In [39]:
data_1=pd.DataFrame({'one1':['a','b','a','a','c','b'],'two1':range(6)})

In [40]:
data_2=pd.DataFrame({'one2':['a','b','c','d'],'two2':range(10,14)})

In [43]:
data=pd.merge(data_1,data_2,left_on='one1',right_on='one2')

In [44]:
data

  one1  two1 one2  two2
0    a     0    a    10
1    a     2    a    10
2    a     3    a    10
3    b     1    b    11
4    b     5    b    11
5    c     4    c    12

In [63]:
data_1=pd.DataFrame({'one':['a','b','a','a','e'],'two1':range(5)})
data_2=pd.DataFrame({'one':['a','b','c','d'],'two2':range(10,14)})

In [64]:
data = pd.merge(data_1,data_2,how='outer')#默认是inner

In [65]:
data

  one  two1  two2
0   a   0.0  10.0
1   a   2.0  10.0
2   a   3.0  10.0
3   b   1.0  11.0
4   e   4.0   NaN
5   c   NaN  12.0
6   d   NaN  13.0

In [66]:
data=pd.merge(data_1,data_2)

In [67]:
data

  one  two1  two2
0   a     0    10
1   a     2    10
2   a     3    10
3   b     1    11

In [68]:
data=pd.merge(data_1,data_2,how='right')#默认按one列合并

In [69]:
data

  one  two1  two2
0   a   0.0    10
1   a   2.0    10
2   a   3.0    10
3   b   1.0    11
4   c   NaN    12
5   d   NaN    13

In [82]:
data1=pd.DataFrame(np.random.randn(3,4),columns=list('abcd'))

In [83]:
data1

          a         b         c         d
0 -0.916802 -0.820845 -0.776507 -0.023763
1  0.403909 -1.994239 -1.274793  0.452140
2  0.204075  2.454070  0.556536 -1.316652

In [81]:
data2=pd.DataFrame(np.random.randint(3,4,(2,3)),columns=list('bda'))

In [84]:
data2

   b  d  a
0  3  3  3
1  3  3  3

In [85]:
data=pd.concat([data1,data2])#注意（）与merge不同

In [87]:
data#data2中没有c列

          a         b         c         d
0 -0.916802 -0.820845 -0.776507 -0.023763
1  0.403909 -1.994239 -1.274793  0.452140
2  0.204075  2.454070  0.556536 -1.316652
0  3.000000  3.000000       NaN  3.000000
1  3.000000  3.000000       NaN  3.000000

In [88]:
data=pd.concat([data1,data2],ignore_index=True)#ignore_index忽略索引

In [90]:
data#ignore_index

          a         b         c         d
0 -0.916802 -0.820845 -0.776507 -0.023763
1  0.403909 -1.994239 -1.274793  0.452140
2  0.204075  2.454070  0.556536 -1.316652
3  3.000000  3.000000       NaN  3.000000
4  3.000000  3.000000       NaN  3.000000

In [92]:
data.append(pd.Series([1,2,3],index=list('abc')),ignore_index=True)#增加数据条

          a         b         c         d
0 -0.916802 -0.820845 -0.776507 -0.023763
1  0.403909 -1.994239 -1.274793  0.452140
2  0.204075  2.454070  0.556536 -1.316652
3  3.000000  3.000000       NaN  3.000000
4  3.000000  3.000000       NaN  3.000000
5  1.000000  2.000000  3.000000       NaN

In [97]:
data_s=data.append(pd.Series((range(5)),index=list('abcde')),ignore_index=True)

In [98]:
data_s

          a         b         c         d    e
0 -0.916802 -0.820845 -0.776507 -0.023763  NaN
1  0.403909 -1.994239 -1.274793  0.452140  NaN
2  0.204075  2.454070  0.556536 -1.316652  NaN
3  3.000000  3.000000       NaN  3.000000  NaN
4  3.000000  3.000000       NaN  3.000000  NaN
5  0.000000  1.000000  2.000000  3.000000  4.0

In [101]:
data_f=data.append(pd.Series(range(5),index=list('abcdf')),ignore_index=True)

In [102]:
data_f

          a         b         c         d    f
0 -0.916802 -0.820845 -0.776507 -0.023763  NaN
1  0.403909 -1.994239 -1.274793  0.452140  NaN
2  0.204075  2.454070  0.556536 -1.316652  NaN
3  3.000000  3.000000       NaN  3.000000  NaN
4  3.000000  3.000000       NaN  3.000000  NaN
5  0.000000  1.000000  2.000000  3.000000  4.0